---
title: AssemblyMemberDifferentCategory
classe: Autodesk.Revit.DB.AssemblyMemberDifferentCategory
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.AssemblyMemberDifference
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# AssemblyMemberDifferentCategory

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CategoryId1 { get; }` | `assemblyMemberDifferentCategory.CategoryId1` | ElementId |
| `ElementId CategoryId2 { get; }` | `assemblyMemberDifferentCategory.CategoryId2` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```